{"class_name": "Model", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 60], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "OffsetAndScale", "config": {"dtype": "float32", "trainable": true, "name": "offset_and_scale_1", "scale": [1.0, 1.0, 1.0, 0.000702403427567333, 0.0003817568067461252, 1.0, 1.0, 1.0, 1.0, 0.00035850045969709754, 0.00011428447760408744, 0.0005045363795943558, 1.0, 1.0, 1.0, 0.000315169949317351, 0.00015559156599920243, 6.952007242944092e-05, 0.0001290320506086573, 0.0009289850131608546, 1.0, 1.0, 0.002507856348529458, 0.0001593814668012783, 5.240791870164685e-05, 0.00015342695405706763, 0.0003576442541088909, 1.0, 1.0, 1.0, 0.0001648719044169411, 7.207795715657994e-05, 0.00014375503815244883, 0.0006546705262735486, 1.0, 1.0, 1.0, 0.00018342853581998497, 0.00015810878539923579, 0.0002641022438183427, 0.0009349188185296953, 1.0, 1.0, 1.0, 1.0, 0.000491963466629386, 0.0009276624768972397, 1.0, 1.0, 16693120.0, 66.66664123535156, 20.77970314025879, 9.747869491577148, 16.84001922607422, 39.80747604370117, 16693120.0, 0.9130633473396301, 4.999996662139893, 1.780063509941101, 1.008998990058899], "offset": [-0.0, -0.0, -0.0, -239.2943878173828, -354.6644592285156, -0.0, -0.0, -0.0, -0.0, -278.9394226074219, -2724.205078125, -338.0, -0.0, -0.0, -0.0, -503.09320068359375, -2249.2861328125, -11381.291015625, -1793.5218505859375, -107.64447021484375, -0.0, -0.0, -39.874691009521484, -2311.51025390625, -28357.7734375, -2486.043701171875, -279.60711669921875, -0.0, -0.0, -0.0, -1872.630615234375, -10168.1123046875, -1920.185791015625, -202.0706024169922, -0.0, -0.0, -0.0, -799.3152465820312, -2095.113525390625, -783.4085083007812, -106.961181640625, -0.0, -0.0, -0.0, -0.0, -314.96075439453125, -141.38827514648438, -0.0, -0.0, -0.40000006556510925, -0.39850008487701416, -0.38850006461143494, -0.392500102519989, -0.3970000147819519, -0.4005001187324524, -0.40000006556510925, -1.4500000476837158, -0.019999999552965164, -0.07408943772315979, -0.024826645851135254]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "offset_and_scale_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 1.0000000116860974e-07, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 25, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["offset_and_scale_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "_sigmoid2", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["dense_1", 0, 0, {}]], [["dense_2", 0, 0, {}]], [["dense_3", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 1.0000000116860974e-07, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 20, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "dense_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 1.0000000116860974e-07, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["activation_1", 1, 0, {}]]], "name": "dense_3"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 2, 0]], "name": "model_1"}, "backend": "theano"}