{"class_name": "Model", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 60], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "OffsetAndScale", "config": {"dtype": "float32", "trainable": true, "name": "offset_and_scale_1", "scale": [0.00012396360798891572, 7.144470747818785e-05, 3.9919230464548706e-05, 2.894568283213948e-05, 9.248549642097895e-06, 4.496246638497259e-05, 0.0002232402305627939, 0.00013493601103276752, 6.073427074556821e-05, 1.666396985712916e-05, 2.263119562320581e-05, 1.2761861545011353e-05, 3.668716087302021e-05, 4.9144141892486864e-05, 9.224692533024262e-05, 7.713254455147452e-05, 1.8551103348849585e-05, 9.679361546706676e-06, 1.6211752797661967e-05, 7.407514549786939e-05, 0.0001939415659036363, 0.00012455991951016758, 5.971447137004325e-05, 1.3843836670462654e-05, 1.1637095991875745e-07, 8.227295711849722e-06, 6.135027189820119e-05, 0.0001725758343551764, 0.00010991092330030712, 8.812612774261393e-05, 1.3738223848323173e-05, 5.155086775383912e-06, 8.853940658574198e-06, 2.019001423518726e-05, 2.633563195221097e-05, 0.0001677205883881925, 7.976984816424248e-05, 2.270999742024496e-05, 4.522902337014584e-06, 1.4182621595284094e-05, 2.874292682084374e-05, 4.1239749356345465e-05, 0.00023328761796309212, 4.127815288020189e-05, 2.5094092276375967e-05, 5.930514097856199e-06, 1.9484285123384743e-05, 6.344424608334012e-05, 7.037832123435676e-05, 73.61586958749396, 32.10439230646502, 15.006645974983398, 9.695999646731542, 15.046309060669143, 32.11854251057687, 74.4291294551161, 0.9235064502314428, 3.375806023654261, 1.993131840812863, 0.9810762348288385], "offset": [-77.98132264581807, -262.30709147280373, -997.6824164476114, -2212.007179759654, -938.6257797699178, -277.4055829271698, -56.447624624885556, -96.04677851061503, -348.0597496524862, -1876.866505604164, -5194.603560767863, -1840.9284784353308, -374.2432897814026, -52.297699202885944, -118.08545004602051, -475.6178774568736, -3683.985189421051, -14170.847068198504, -3755.515313433624, -465.9795854320017, -90.6020796151886, -111.31642544708761, -647.6397079393208, -5967.345661576218, -26803.571998519496, -6237.093135361091, -649.1336478527603, -102.74261682549795, -97.91162964339193, -467.3927768817774, -3662.9289741952157, -14050.828207716057, -3869.587946028966, -556.3506982379456, -53.94530633420817, -73.00149302798462, -331.96460160958355, -1948.5262829753976, -6770.112239128271, -2013.567952815567, -343.49577550603993, -109.48410934296672, -75.4798130584615, -300.37150395173137, -1159.9794938371888, -3846.391124034411, -1257.4582139421082, -288.3650485896352, -40.889043834635416, -0.3989615559212317, -0.3946560432641556, -0.3840180722505773, -0.38671031897876906, -0.38417636808908484, -0.39469109743356456, -0.39898158925543475, -1.3457734166666666, -0.00029916666666666666, -0.11059097081343167, 0.0008154932911870795]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "offset_and_scale_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 25, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["offset_and_scale_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAADAAAACAAAAEMAAABzXQAAAGQBAGQAAGwAAH0BAHQBAGoCAHwBAGoDAGoEAIMBAH0CAHQF\nAGoGAHQFAGoHAGQCAHwAABR8AgCDAgBkAwB8AAAUZAQAZAQAdAUAaggAZAIAfAAAFIMBABcVgwMA\nUygFAAAATmn/////af7///9nAAAAAAAAAABnAAAAAAAA8D8oCQAAAHQDAAAAc3lzdAIAAABucHQD\nAAAAbG9ndAoAAABmbG9hdF9pbmZvdAMAAABtYXh0AQAAAEt0BgAAAHN3aXRjaHQNAAAAZ3JlYXRl\ncl9lcXVhbHQDAAAAZXhwKAMAAAB0AQAAAHhSAAAAAHQGAAAATUFYRVhQKAAAAAAoAAAAAHNMAAAA\nL2Fmcy9jZXJuLmNoL3VzZXIvbC9sZ2Fnbm9uL3B1YmxpYy9zb3VyY2UvUGl4ZWxDbHVzTk5DYWxp\nYi90dHJhaW5lZDJrZXJhcy5weXQIAAAAc2lnbW9pZDIKAAAAcwwAAAAAAQwBFQEGARMBBwE=\n", null, null], "name": "lambda_1", "dtype": "float32", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "lambda_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 20, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "dense_2"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAADAAAACAAAAEMAAABzXQAAAGQBAGQAAGwAAH0BAHQBAGoCAHwBAGoDAGoEAIMBAH0CAHQF\nAGoGAHQFAGoHAGQCAHwAABR8AgCDAgBkAwB8AAAUZAQAZAQAdAUAaggAZAIAfAAAFIMBABcVgwMA\nUygFAAAATmn/////af7///9nAAAAAAAAAABnAAAAAAAA8D8oCQAAAHQDAAAAc3lzdAIAAABucHQD\nAAAAbG9ndAoAAABmbG9hdF9pbmZvdAMAAABtYXh0AQAAAEt0BgAAAHN3aXRjaHQNAAAAZ3JlYXRl\ncl9lcXVhbHQDAAAAZXhwKAMAAAB0AQAAAHhSAAAAAHQGAAAATUFYRVhQKAAAAAAoAAAAAHNMAAAA\nL2Fmcy9jZXJuLmNoL3VzZXIvbC9sZ2Fnbm9uL3B1YmxpYy9zb3VyY2UvUGl4ZWxDbHVzTk5DYWxp\nYi90dHJhaW5lZDJrZXJhcy5weXQIAAAAc2lnbW9pZDIKAAAAcwwAAAAAAQwBFQEGARMBBwE=\n", null, null], "name": "lambda_2", "dtype": "float32", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "lambda_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_2", 0, 0, {}]]], "name": "dense_3"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAADAAAACAAAAEMAAABzXQAAAGQBAGQAAGwAAH0BAHQBAGoCAHwBAGoDAGoEAIMBAH0CAHQF\nAGoGAHQFAGoHAGQCAHwAABR8AgCDAgBkAwB8AAAUZAQAZAQAdAUAaggAZAIAfAAAFIMBABcVgwMA\nUygFAAAATmn/////af7///9nAAAAAAAAAABnAAAAAAAA8D8oCQAAAHQDAAAAc3lzdAIAAABucHQD\nAAAAbG9ndAoAAABmbG9hdF9pbmZvdAMAAABtYXh0AQAAAEt0BgAAAHN3aXRjaHQNAAAAZ3JlYXRl\ncl9lcXVhbHQDAAAAZXhwKAMAAAB0AQAAAHhSAAAAAHQGAAAATUFYRVhQKAAAAAAoAAAAAHNMAAAA\nL2Fmcy9jZXJuLmNoL3VzZXIvbC9sZ2Fnbm9uL3B1YmxpYy9zb3VyY2UvUGl4ZWxDbHVzTk5DYWxp\nYi90dHJhaW5lZDJrZXJhcy5weXQIAAAAc2lnbW9pZDIKAAAAcwwAAAAAAQwBFQEGARMBBwE=\n", null, null], "name": "lambda_3", "dtype": "float32", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "lambda_3"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["lambda_3", 0, 0]], "name": "model_1"}, "backend": "theano"}